/* 68. Напишe программу вычисления функции Аккермана с помощью рекурсии. 
Даны два неотрицательных числа m и n.
m = 3, n = 2 -> A(m,n) = 29 */
// --------------------------------------------------------------------------------------------
/*Функция Аккермана — простой пример вычислимой функции, которая не является примитивно рекурсивной.
Она обозначается A(m,n), принимает два неотрицательных целых числа в качестве параметров и возвращает натуральное число.

          { n + 1,                  m = 0;
A(m, n) = { A(m - 1, 1),            m > 0, n = 0;
          { A(m - 1, A(m, n - 1)),  m > 0, n > 0.
    
*/

Console.Clear();
Console.Write($"Введите число M: ");
int m = int.Parse(Console.ReadLine());
Console.Write($"Введите число N: ");
int n = int.Parse(Console.ReadLine());

int functionAkkerman = Ack(m, n);

Console.Write($"Функция Аккермана = {functionAkkerman} ");

int Ack(int m, int n)
{
    if (m == 0) return n + 1;
    else if (n == 0) return Ack(m - 1, 1);
    else return Ack(m - 1, Ack(m, n - 1));
}

// Работает! 

